posts/2024-08-15-web-learning-in-practice.org
#+title: Web learning in practice
#+date: <2024-08-15 19:26>
#+description: This post records the basic web development knowledge I have learned in practice.
#+filetags: web app

This post records the basic web development knowledge I have learned in practice.

* Basic html structure
#+begin_src html
<!DOCTYPE html>
<html lang="en">

    <!-- A head -->
    <head>
        <meta charset="UTF-8">
        <!-- to accommodate different screen size -->
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <!-- A tab name -->
        <title>A website</title>
        <link rel="stylesheet" href="styles.css">
    </head>


    <!-- A body -->
    <<body>
    <!-- A page header  -->
    <header>
        <h1>Welcome</h1>
    </header>

    <!-- A navigation panel -->
    <nav>
        <ul>
        <<li><a href="index.html">Home</a></li>
        </ul>
    </nav>

    <!-- The main content -->
    <main>
        <section id="home">
        <h2>Home</h2>
        <p>Welcome!</p>
        </section>
    </main>

    <!-- A footer -->
    <footer>
        <p>&copy; All rights reserved.</p>
    </footer>
    </body>

</html>
#+end_src

* Tags
- ~<a>~: contain links; have following attributes:
  - ~target="_blank"~: open the link in a new tab.
  - ~title="Go to the link"~: the tooltip message, i.e., the floating message when a user hovers over.
- ~<span>~: don't add line breaks before or after it.
- ~<hr>~: horizontal rule.

* Attributes
- ~id="home"~:
  - allow specific styling of the element, e.g., ~#home ul {...}~ only styles the ~ul~ in the block with the same id.
