2024-08-15-web-learning-in-practice.html
<!doctype html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta
      name="description"
      content="This post records the basic web development knowledge I have learned in practice."
    />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://chenyo-17.github.io/org-static-blog/rss.xml"
      title="RSS feed for https://chenyo-17.github.io/org-static-blog"
    />
    <title>Web learning in practice</title>
    <meta name="author" content="chenyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link rel="stylesheet" href="static/style.css" type="text/css" />
  </head>
  <body>
    <div id="preamble" class="status">
      <header>
        <h1><a href="/">Chenyo's org-static-blog</a></h1>
        <nav>
          <a href="/">Home</a>
          <a href="archive.html">Archive</a>
          <a href="tags.html">Tags</a>
          <div id="search-container">
            <input
              type="text"
              id="search-input"
              placeholder="Search anywhere..."
            />
          </div>
        </nav>
      </header>
    </div>
    <div id="content">
      <div class="post-date">15 Aug 2024</div>
      <h1 class="post-title">
        <a
          href="https://chenyo-17.github.io/org-static-blog/2024-08-15-web-learning-in-practice.html"
          >Web learning in practice</a
        >
      </h1>
      <nav id="table-of-contents" role="doc-toc">
        <h2>Table of Contents</h2>
        <div id="text-table-of-contents" role="doc-toc">
          <ul>
            <li><a href="#orge5a62eb">1. Basic html structure</a></li>
            <li><a href="#org7d8ea99">2. Tags</a></li>
            <li><a href="#orge384dd1">3. Attributes</a></li>
          </ul>
        </div>
      </nav>
      <p>
        This post records the basic web development knowledge I have learned in
        practice.
      </p>
      <div id="outline-container-orge5a62eb" class="outline-2">
        <h2 id="orge5a62eb">
          <span class="section-number-2">1.</span> Basic html structure
        </h2>
        <div class="outline-text-2" id="text-1">
          <div class="org-src-container">
            <pre
              class="src src-html"
            >&lt;<span style="color: #51afef;">!DOCTYPE</span> html&gt;
&lt;<span style="color: #c678dd;">html</span> <span style="color: #dcaeea;">lang</span>=<span style="color: #98be65;">"en"</span>&gt;

    <span style="color: #5B6268;">&lt;!-- </span><span style="color: #5B6268;">A head</span><span style="color: #5B6268;"> --&gt;</span>
    &lt;<span style="color: #c678dd;">head</span>&gt;
        &lt;<span style="color: #c678dd;">meta</span> <span style="color: #dcaeea;">charset</span>=<span style="color: #98be65;">"UTF-8"</span>&gt;
        <span style="color: #5B6268;">&lt;!-- </span><span style="color: #5B6268;">to accommodate different screen size</span><span style="color: #5B6268;"> --&gt;</span>
        &lt;<span style="color: #c678dd;">meta</span> <span style="color: #dcaeea;">name</span>=<span style="color: #98be65;">"viewport"</span> <span style="color: #dcaeea;">content</span>=<span style="color: #98be65;">"width=device-width, initial-scale=1.0"</span>&gt;
        <span style="color: #5B6268;">&lt;!-- </span><span style="color: #5B6268;">A tab name</span><span style="color: #5B6268;"> --&gt;</span>
        &lt;<span style="color: #c678dd;">title</span>&gt;<span style="font-weight: bold; text-decoration: underline;">A website</span>&lt;/<span style="color: #c678dd;">title</span>&gt;
        &lt;<span style="color: #c678dd;">link</span> <span style="color: #dcaeea;">rel</span>=<span style="color: #98be65;">"stylesheet"</span> <span style="color: #dcaeea;">href</span>=<span style="color: #98be65;">"styles.css"</span>&gt;
    &lt;/<span style="color: #c678dd;">head</span>&gt;


    <span style="color: #5B6268;">&lt;!-- </span><span style="color: #5B6268;">A body</span><span style="color: #5B6268;"> --&gt;</span>
    &lt;&lt;<span style="color: #c678dd;">body</span>&gt;
    <span style="color: #5B6268;">&lt;!-- </span><span style="color: #5B6268;">A page header</span><span style="color: #5B6268;">  --&gt;</span>
    &lt;<span style="color: #c678dd;">header</span>&gt;
        &lt;<span style="color: #c678dd;">h1</span>&gt;<span style="font-weight: bold; text-decoration: underline;">Welcome</span>&lt;/<span style="color: #c678dd;">h1</span>&gt;
    &lt;/<span style="color: #c678dd;">header</span>&gt;

    <span style="color: #5B6268;">&lt;!-- </span><span style="color: #5B6268;">A navigation panel</span><span style="color: #5B6268;"> --&gt;</span>
    &lt;<span style="color: #c678dd;">nav</span>&gt;
        &lt;<span style="color: #c678dd;">ul</span>&gt;
        &lt;&lt;<span style="color: #c678dd;">li</span>&gt;&lt;<span style="color: #c678dd;">a</span> <span style="color: #dcaeea;">href</span>=<span style="color: #98be65;">"index.html"</span>&gt;Home&lt;/<span style="color: #c678dd;">a</span>&gt;&lt;/<span style="color: #c678dd;">li</span>&gt;
        &lt;/<span style="color: #c678dd;">ul</span>&gt;
    &lt;/<span style="color: #c678dd;">nav</span>&gt;

    <span style="color: #5B6268;">&lt;!-- </span><span style="color: #5B6268;">The main content</span><span style="color: #5B6268;"> --&gt;</span>
    &lt;<span style="color: #c678dd;">main</span>&gt;
        &lt;<span style="color: #c678dd;">section</span> <span style="color: #dcaeea;">id</span>=<span style="color: #98be65;">"home"</span>&gt;
        &lt;<span style="color: #c678dd;">h2</span>&gt;<span style="font-weight: bold; font-style: italic; text-decoration: underline;">Home</span>&lt;/<span style="color: #c678dd;">h2</span>&gt;
        &lt;<span style="color: #c678dd;">p</span>&gt;Welcome!&lt;/<span style="color: #c678dd;">p</span>&gt;
        &lt;/<span style="color: #c678dd;">section</span>&gt;
    &lt;/<span style="color: #c678dd;">main</span>&gt;

    <span style="color: #5B6268;">&lt;!-- </span><span style="color: #5B6268;">A footer</span><span style="color: #5B6268;"> --&gt;</span>
    &lt;<span style="color: #c678dd;">footer</span>&gt;
        &lt;<span style="color: #c678dd;">p</span>&gt;<span style="color: #dcaeea;">&amp;copy;</span> All rights reserved.&lt;/<span style="color: #c678dd;">p</span>&gt;
    &lt;/<span style="color: #c678dd;">footer</span>&gt;
    &lt;/<span style="color: #c678dd;">body</span>&gt;

&lt;/<span style="color: #c678dd;">html</span>&gt;
</pre>
          </div>
        </div>
      </div>
      <div id="outline-container-org7d8ea99" class="outline-2">
        <h2 id="org7d8ea99"><span class="section-number-2">2.</span> Tags</h2>
        <div class="outline-text-2" id="text-2">
          <ul class="org-ul">
            <li>
              <code>&lt;a&gt;</code>: contain links; have following attributes:
              <ul class="org-ul">
                <li>
                  <code>target="_blank"</code>: open the link in a new tab.
                </li>
                <li>
                  <code>title="Go to the link"</code>: the tooltip message,
                  i.e., the floating message when a user hovers over.
                </li>
              </ul>
            </li>
            <li>
              <code>&lt;span&gt;</code>: don&rsquo;t add line breaks before or
              after it.
            </li>
            <li><code>&lt;hr&gt;</code>: horizontal rule.</li>
          </ul>
        </div>
      </div>
      <div id="outline-container-orge384dd1" class="outline-2">
        <h2 id="orge384dd1">
          <span class="section-number-2">3.</span> Attributes
        </h2>
        <div class="outline-text-2" id="text-3">
          <ul class="org-ul">
            <li>
              <code>id="home"</code>:
              <ul class="org-ul">
                <li>
                  allow specific styling of the element, e.g.,
                  <code>#home ul {...}</code> only styles the <code>ul</code> in
                  the block with the same id.
                </li>
              </ul>
            </li>
          </ul>
        </div>
      </div>
      <div class="taglist">
        <a href="https://chenyo-17.github.io/org-static-blog/tags.html">Tags</a
        >:
        <a href="https://chenyo-17.github.io/org-static-blog/tag-web.html"
          >web</a
        >
        <a href="https://chenyo-17.github.io/org-static-blog/tag-app.html"
          >app</a
        >
      </div>
    </div>
    <div id="postamble" class="status">
      <div id="search-results"></div>
      <footer>
        <p>© 2024 chenyo. Some rights reserved.</p>
      </footer>
    </div>
  </body>
</html>
